app/views/clubs/show.html.erb

SELECT  "clubs".* FROM "clubs"  WHERE "clubs"."id" = ? LIMIT 1  [["id", 2]]
---
  <!--<strong>Club:</strong>-->
  <% @club = Club.find(params[:id]) %>