app/controllers/clubs_controller.rb

SELECT "clubs".* FROM "clubs"
---
  def index
    @clubs = Club.all

INSERT INTO "clubs" ("Admin", "Name", "NumberOfMembers", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["Admin", "Michael "], ["Name", "Cooking Club"], ["NumberOfMembers", 5], ["category", "Sports"], ["created_at", "2016-04-26 20:41:23.585052"], ["updated_at", "2016-04-26 20:41:23.585052"]]
---
  def create
    @club = Club.new(club_params)

    respond_to do |format|
      if @club.save

SELECT  "clubs".* FROM "clubs"  WHERE "clubs"."id" = ? LIMIT 1  [["id", 0]]
---
    def set_club
      @club = Club.find(params[:id])