app/controllers/posts_controller.rb

INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Test body"], ["created_at", "2016-02-23 05:16:17.314557"], ["title", "Test Post"], ["updated_at", "2016-02-23 05:16:17.314557"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save