app/controllers/users_controller.rb

  def create
<<<<<<< HEAD
	@user = User.new
=======
    @user = User.new(params[:id])
      if @user.save
---
INSERT INTO "users" ("created_at", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2016-02-21 22:56:26.339839"], ["name", "Jashan"], ["password_digest", "$2a$10$xKHTH3O8i540ZmheDIiAQeh8mmk11UNEhF2q47FmtUA9GLIrgGVby"], ["updated_at", "2016-02-21 22:56:26.339839"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 18  [["password_digest", "$2a$10$CtyiyxYYMDZog.oaOiThdunObhbQAfjhceopCy6Qr6nInObK1DKAG"], ["updated_at", "2016-02-23 03:35:51.773071"]]