app/views/categories/show.html.erb

SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
---
  <tbody>
    <%  @name = Category.find(params[:id]) %>